#+TITLE: Align-BDD project
#+CATEGORY: a-BDD
#+STARTUP: show2levels

* Immediate TODOs
  - [X] 1: soft cover constraints (general type) -- see the revision notes
  - [X] idea 2a (cross-terms, x1x2, etc.)
  - [ ] idea 2b (function of cross-terms) -- ?
  - [X] =build_cover_DD=: make single overlap version
  - [X] =build_type_DD=: fix the procedure (linear DD growth is doable!)
  - [X] =build_tUFLP_MIP=: revise to single overlap version
  - [X] cross-check DDs with the MIP (simple)
  - [X] fix the bug in cover DD generation (infinite loop?..)
  - [X] cross-check DDs with the MIP (random set)
  - [X] test the align-BDD version.
  - [X] implement type ordering / fix the type-DD order
  - [X] test the new problem (against Gurobi) -- runtimes.
  - [X] special case instance (string): diagram sizes
  - [X] special case (organic thing): dia sizes. Is it max degree?
  - [X] example of 'arbitrarily poor' heuristic.
  - [X] randomized cover-DD builder (random order of nodes)
  - [X] randomized type-DD builder
  - [X] num test
  - [ ] check out if the costs are correct for =build_type_DD=.
    I thought it was not assume to include costs at all. How does it pass the tests?..
  - [ ] maybe generate t-UFLP differently?
    distribute the first facility into every bin, and then sort them randomly?

* Current project TODOs
** TODO Rewrite comments
[2022-05-09 Mon 15:46]
[[file:~/projects/align-BDD/darkcloud.py::def build_type_DD(self)]]
** TODO Add assertion to the instance type
[2022-05-03 Tue 14:10]
[[file:~/projects/align-BDD/darkcloud.py]]

'string' shape only.
** TODO Design dark-cloud algo for relaxed cavemen graph / UFLP
SCHEDULED: <2022-05-05 Thu>
:LOGBOOK:
CLOCK: [2022-05-04 Wed 14:13]--[2022-05-04 Wed 14:16] =>  0:03
CLOCK: [2022-05-04 Wed 13:56]--[2022-05-04 Wed 14:02] =>  0:06
CLOCK: [2022-05-03 Tue 20:13]--[2022-05-03 Tue 20:23] =>  0:10
CLOCK: [2022-05-03 Tue 14:25]--[2022-05-03 Tue 14:44] =>  0:19
CLOCK: [2022-05-03 Tue 13:59]--[2022-05-03 Tue 14:14] =>  0:15
CLOCK: [2022-05-03 Tue 13:20]--[2022-05-03 Tue 13:52] =>  0:32
CLOCK: [2022-05-03 Tue 12:40]--[2022-05-03 Tue 13:12] =>  0:32
CLOCK: [2022-05-03 Tue 12:12]--[2022-05-03 Tue 12:20] =>  0:08
CLOCK: [2022-05-03 Tue 12:01]--[2022-05-03 Tue 12:07] =>  0:06
CLOCK: [2022-05-03 Tue 10:24]--[2022-05-03 Tue 10:37] =>  0:13
CLOCK: [2022-05-03 Tue 09:55]--[2022-05-03 Tue 10:05] =>  0:10
CLOCK: [2022-05-03 Tue 09:02]--[2022-05-03 Tue 09:44] =>  0:42
CLOCK: [2022-05-02 Mon 19:32]--[2022-05-02 Mon 19:48] =>  0:16
CLOCK: [2022-05-02 Mon 19:05]--[2022-05-02 Mon 19:15] =>  0:10
CLOCK: [2022-05-02 Mon 19:03]--[2022-05-02 Mon 19:04] =>  0:01
CLOCK: [2022-05-02 Mon 15:43]--[2022-05-02 Mon 15:53] =>  0:10
CLOCK: [2022-05-02 Mon 15:05]--[2022-05-02 Mon 15:20] =>  0:15
CLOCK: [2022-05-02 Mon 14:29]--[2022-05-02 Mon 15:01] =>  0:32
CLOCK: [2022-05-02 Mon 14:25]--[2022-05-02 Mon 14:26] =>  0:01
CLOCK: [2022-05-02 Mon 13:14]--[2022-05-02 Mon 14:24] =>  1:10
CLOCK: [2022-04-29 Fri 15:50]--[2022-04-29 Fri 15:58] =>  0:08
CLOCK: [2022-04-29 Fri 15:11]--[2022-04-29 Fri 15:33] =>  0:22
CLOCK: [2022-04-29 Fri 14:34]--[2022-04-29 Fri 14:57] =>  0:23
CLOCK: [2022-04-29 Fri 14:19]--[2022-04-29 Fri 14:31] =>  0:12
CLOCK: [2022-04-29 Fri 14:04]--[2022-04-29 Fri 14:14] =>  0:10
CLOCK: [2022-04-29 Fri 13:16]--[2022-04-29 Fri 13:43] =>  0:27
CLOCK: [2022-04-29 Fri 12:41]--[2022-04-29 Fri 12:50] =>  0:09
CLOCK: [2022-04-27 Wed 15:05]--[2022-04-27 Wed 15:29] =>  0:24
CLOCK: [2022-03-23 Wed 15:56]--[2022-03-23 Wed 16:02] =>  0:06
CLOCK: [2022-03-23 Wed 15:48]--[2022-03-23 Wed 15:55] =>  0:07
CLOCK: [2022-03-23 Wed 15:30]--[2022-03-23 Wed 15:38] =>  0:08
CLOCK: [2022-03-23 Wed 15:16]--[2022-03-23 Wed 15:28] =>  0:12
CLOCK: [2022-03-23 Wed 14:54]--[2022-03-23 Wed 15:11] =>  0:17
CLOCK: [2022-03-23 Wed 09:45]--[2022-03-23 Wed 09:49] =>  0:04
CLOCK: [2022-03-22 Tue 16:24]--[2022-03-22 Tue 16:26] =>  0:02
CLOCK: [2022-03-22 Tue 14:50]--[2022-03-22 Tue 14:51] =>  0:01
CLOCK: [2022-03-22 Tue 14:25]--[2022-03-22 Tue 14:30] =>  0:05
CLOCK: [2022-03-22 Tue 13:35]--[2022-03-22 Tue 13:46] =>  0:11
CLOCK: [2022-03-22 Tue 13:29]--[2022-03-22 Tue 13:30] =>  0:01
CLOCK: [2022-03-22 Tue 13:09]--[2022-03-22 Tue 13:14] =>  0:05
CLOCK: [2022-03-22 Tue 12:59]--[2022-03-22 Tue 13:01] =>  0:02
CLOCK: [2022-03-22 Tue 12:42]--[2022-03-22 Tue 12:54] =>  0:12
CLOCK: [2022-03-22 Tue 12:19]--[2022-03-22 Tue 12:22] =>  0:03
CLOCK: [2022-03-17 Thu 18:21]--[2022-03-17 Thu 18:26] =>  0:05
CLOCK: [2022-03-16 Wed 17:10]--[2022-03-16 Wed 17:14] =>  0:04
CLOCK: [2022-03-16 Wed 16:45]--[2022-03-16 Wed 17:05] =>  0:20
CLOCK: [2022-03-16 Wed 16:20]--[2022-03-16 Wed 16:25] =>  0:05
CLOCK: [2022-03-16 Wed 15:47]--[2022-03-16 Wed 16:19] =>  0:32
CLOCK: [2022-03-16 Wed 15:22]--[2022-03-16 Wed 15:44] =>  0:22
CLOCK: [2022-03-16 Wed 14:55]--[2022-03-16 Wed 15:19] =>  0:24
CLOCK: [2022-03-16 Wed 14:45]--[2022-03-16 Wed 14:53] =>  0:08
CLOCK: [2022-03-14 Mon 14:49]--[2022-03-14 Mon 14:52] =>  0:03
CLOCK: [2022-03-14 Mon 14:30]--[2022-03-14 Mon 14:44] =>  0:14
CLOCK: [2022-03-14 Mon 14:17]--[2022-03-14 Mon 14:27] =>  0:10
CLOCK: [2022-03-11 Fri 15:52]--[2022-03-11 Fri 16:12] =>  0:20
CLOCK: [2022-03-11 Fri 15:39]--[2022-03-11 Fri 15:52] =>  0:13
CLOCK: [2022-03-11 Fri 15:30]--[2022-03-11 Fri 15:35] =>  0:05
CLOCK: [2022-03-11 Fri 15:01]--[2022-03-11 Fri 15:20] =>  0:19
CLOCK: [2022-03-11 Fri 14:36]--[2022-03-11 Fri 14:55] =>  0:19
CLOCK: [2022-03-11 Fri 13:53]--[2022-03-11 Fri 13:58] =>  0:05
:END:
*** DONE Implement =calc= cloud calculation
CLOSED: [2022-05-05 Thu 19:48]
- State "DONE"       from "TODO"       [2022-05-05 Thu 19:48]
:LOGBOOK:
CLOCK: [2022-05-05 Thu 19:28]--[2022-05-05 Thu 19:48] =>  0:20
CLOCK: [2022-05-05 Thu 19:10]--[2022-05-05 Thu 19:20] =>  0:10
CLOCK: [2022-05-05 Thu 18:52]--[2022-05-05 Thu 18:54] =>  0:02
CLOCK: [2022-05-05 Thu 15:25]--[2022-05-05 Thu 15:48] =>  0:23
CLOCK: [2022-05-05 Thu 15:05]--[2022-05-05 Thu 15:17] =>  0:12
CLOCK: [2022-05-05 Thu 14:33]--[2022-05-05 Thu 14:42] =>  0:09
CLOCK: [2022-05-05 Thu 13:30]--[2022-05-05 Thu 13:33] =>  0:03
CLOCK: [2022-05-05 Thu 12:58]--[2022-05-05 Thu 13:07] =>  0:09
:END:
*** DONE Instances generation (w/metadata)
CLOSED: [2022-05-06 Fri 17:50]
- State "DONE"       from "TODO"       [2022-05-06 Fri 17:50]
:LOGBOOK:
CLOCK: [2022-05-06 Fri 17:24]--[2022-05-06 Fri 17:49] =>  0:25
CLOCK: [2022-05-06 Fri 17:13]--[2022-05-06 Fri 17:17] =>  0:04
CLOCK: [2022-05-06 Fri 16:28]--[2022-05-06 Fri 16:59] =>  0:31
CLOCK: [2022-05-06 Fri 15:40]--[2022-05-06 Fri 15:46] =>  0:06
CLOCK: [2022-05-06 Fri 15:01]--[2022-05-06 Fri 15:34] =>  0:33
CLOCK: [2022-05-06 Fri 14:26]--[2022-05-06 Fri 14:42] =>  0:16
CLOCK: [2022-05-06 Fri 14:17]--[2022-05-06 Fri 14:18] =>  0:01
CLOCK: [2022-05-06 Fri 13:43]--[2022-05-06 Fri 13:46] =>  0:03
CLOCK: [2022-05-06 Fri 12:17]--[2022-05-06 Fri 12:29] =>  0:12
CLOCK: [2022-05-06 Fri 11:51]--[2022-05-06 Fri 12:12] =>  0:21
CLOCK: [2022-05-06 Fri 11:39]--[2022-05-06 Fri 11:42] =>  0:03
:END:
*** DONE More testing (algo)
CLOSED: [2022-05-06 Fri 17:50]
- State "DONE"       from "TODO"       [2022-05-06 Fri 17:50]
*** DONE Check runtimes MIP vs BDD
CLOSED: [2022-05-09 Mon 14:59]
- State "DONE"       from "TODO"       [2022-05-09 Mon 14:59]
:LOGBOOK:
CLOCK: [2022-05-09 Mon 12:25]--[2022-05-09 Mon 12:48] =>  0:23
CLOCK: [2022-05-07 Sat 10:36]--[2022-05-07 Sat 10:54] =>  0:18
CLOCK: [2022-05-06 Fri 18:10]--[2022-05-06 Fri 18:18] =>  0:08
CLOCK: [2022-05-06 Fri 18:05]--[2022-05-06 Fri 18:06] =>  0:01
:END:
See [[./run_logs/darkcloud_BDD_vs_MIP_longMIP.csv]]

*** TODO Recover caves data from an instance
:LOGBOOK:
CLOCK: [2022-05-09 Mon 14:04]--[2022-05-09 Mon 14:23] =>  0:19
CLOCK: [2022-05-09 Mon 13:59]--[2022-05-09 Mon 14:00] =>  0:01
CLOCK: [2022-05-09 Mon 13:00]--[2022-05-09 Mon 13:08] =>  0:08
:END:
  An algorithm sketch:
  - start with 1 cloud = 1 point (so, $N$ clouds),
  - run a BFS, and
  - join two clouds every time I encounter an already-visited point?
** DONE Darkcloud: add types
CLOSED: [2022-05-09 Mon 20:38]
- State "DONE"       from "TODO"       [2022-05-09 Mon 20:38]
:LOGBOOK:
CLOCK: [2022-05-09 Mon 18:58]--[2022-05-09 Mon 19:00] =>  0:02
CLOCK: [2022-05-09 Mon 18:26]--[2022-05-09 Mon 18:43] =>  0:17
CLOCK: [2022-05-09 Mon 18:20]--[2022-05-09 Mon 18:25] =>  0:05
CLOCK: [2022-05-09 Mon 16:55]--[2022-05-09 Mon 17:04] =>  0:09
CLOCK: [2022-05-09 Mon 16:07]--[2022-05-09 Mon 16:30] =>  0:23
CLOCK: [2022-05-09 Mon 15:25]--[2022-05-09 Mon 15:48] =>  0:23
CLOCK: [2022-05-09 Mon 15:02]--[2022-05-09 Mon 15:08] =>  0:06
CLOCK: [2022-05-09 Mon 14:34]--[2022-05-09 Mon 14:59] =>  0:25
:END:
** Softcover: design instances with types
:LOGBOOK:
CLOCK: [2022-01-24 Mon 12:16]--[2022-01-24 Mon 12:40] =>  0:24
:END:
*** DONE Design cover DDs (Bool -> Int)
CLOSED: [2022-01-27 Thu 15:11]
- State "DONE"       from "TODO"       [2022-01-27 Thu 15:11]
:LOGBOOK:
CLOCK: [2022-01-27 Thu 14:31]--[2022-01-27 Thu 14:58] =>  0:27
CLOCK: [2022-01-27 Thu 13:36]--[2022-01-27 Thu 14:18] =>  0:42
CLOCK: [2022-01-26 Wed 19:46]--[2022-01-26 Wed 19:47] =>  0:01
CLOCK: [2022-01-26 Wed 17:42]--[2022-01-26 Wed 18:11] =>  0:29
CLOCK: [2022-01-26 Wed 17:20]--[2022-01-26 Wed 17:41] =>  0:21
CLOCK: [2022-01-26 Wed 17:12]--[2022-01-26 Wed 17:20] =>  0:08
CLOCK: [2022-01-26 Wed 16:21]--[2022-01-26 Wed 16:33] =>  0:12
CLOCK: [2022-01-26 Wed 14:40]--[2022-01-26 Wed 16:21] =>  1:41
CLOCK: [2022-01-26 Wed 14:04]--[2022-01-26 Wed 14:18] =>  0:14
CLOCK: [2022-01-26 Wed 13:45]--[2022-01-26 Wed 13:57] =>  0:12
CLOCK: [2022-01-26 Wed 13:08]--[2022-01-26 Wed 13:43] =>  0:35
CLOCK: [2022-01-24 Mon 15:13]--[2022-01-24 Mon 15:32] =>  0:19
CLOCK: [2022-01-24 Mon 13:16]--[2022-01-24 Mon 14:23] =>  1:07
CLOCK: [2022-01-24 Mon 12:59]--[2022-01-24 Mon 13:10] =>  0:11
CLOCK: [2022-01-24 Mon 12:55]--[2022-01-24 Mon 12:56] =>  0:01
:END:
Check it is correct, technically.
*** DONE Check dia sizes scaling (with and w/o reduction) vs. no of vars in MIP
CLOSED: [2022-01-28 Fri 17:21]
- State "DONE"       from "TODO"       [2022-01-28 Fri 17:21]
:LOGBOOK:
CLOCK: [2022-01-28 Fri 15:30]--[2022-01-28 Fri 16:24] =>  0:54
CLOCK: [2022-01-28 Fri 14:05]--[2022-01-28 Fri 14:42] =>  0:37
CLOCK: [2022-01-28 Fri 13:59]--[2022-01-28 Fri 14:03] =>  0:04
CLOCK: [2022-01-27 Thu 18:57]--[2022-01-27 Thu 19:17] =>  0:20
CLOCK: [2022-01-27 Thu 15:16]--[2022-01-27 Thu 15:26] =>  0:10
CLOCK: [2022-01-27 Thu 15:11]--[2022-01-27 Thu 15:14] =>  0:03
:END:
So, without reduction, I basically create an exponentially sized diagrams. This
makes sense, if I am not smart with this ``forgetting'' nodes (after they have zero
``degrees of freedom'').

However, it is not really bright even in theoretical case of writing down a
reduced dia as well...

*** DONE Repeat the experiment for a more narrow graph type (cavemen?)
CLOSED: [2022-01-28 Fri 20:12]
- State "DONE"       from "TODO"       [2022-01-28 Fri 20:12]
:LOGBOOK:
CLOCK: [2022-01-28 Fri 19:17]--[2022-01-28 Fri 20:12] =>  0:55
CLOCK: [2022-01-28 Fri 18:34]--[2022-01-28 Fri 18:55] =>  0:21
CLOCK: [2022-01-28 Fri 17:21]--[2022-01-28 Fri 17:59] =>  0:38
:END:

*** DONE make improved cover-building algo
CLOSED: [2022-03-11 Fri 13:21]
- State "DONE"       from "TODO"       [2022-03-11 Fri 13:21]
:LOGBOOK:
CLOCK: [2022-02-15 Tue 15:09]--[2022-02-15 Tue 15:28] =>  0:19
CLOCK: [2022-02-15 Tue 14:14]--[2022-02-15 Tue 15:05] =>  0:51
CLOCK: [2022-02-15 Tue 13:20]--[2022-02-15 Tue 13:28] =>  0:08
CLOCK: [2022-02-15 Tue 12:09]--[2022-02-15 Tue 12:17] =>  0:08
CLOCK: [2022-02-15 Tue 10:51]--[2022-02-15 Tue 11:54] =>  1:03
CLOCK: [2022-02-14 Mon 18:49]--[2022-02-14 Mon 18:55] =>  0:06
CLOCK: [2022-02-01 Tue 13:36]--[2022-02-01 Tue 13:58] =>  0:22
CLOCK: [2022-01-31 Mon 15:18]--[2022-01-31 Mon 15:29] =>  0:11
CLOCK: [2022-01-31 Mon 14:40]--[2022-01-31 Mon 15:11] =>  0:31
CLOCK: [2022-01-31 Mon 14:12]--[2022-01-31 Mon 14:16] =>  0:04
CLOCK: [2022-01-31 Mon 13:16]--[2022-01-31 Mon 13:35] =>  0:19
:END:
*** DONE Compare runtimes w/o types: BDDs vs naive MIP
CLOSED: [2022-03-11 Fri 13:21]
- State "DONE"       from "TODO"       [2022-03-11 Fri 13:21]
:LOGBOOK:
CLOCK: [2022-02-23 Wed 15:41]--[2022-02-23 Wed 16:08] =>  0:27
CLOCK: [2022-02-23 Wed 15:31]--[2022-02-23 Wed 15:37] =>  0:06
:END:
*** LATER Add types -- generate CPP instances 
*** LATER Compare runtime: naive MIP vs CPP MIP vs Align-BDD CPP
*** LATER Add reduction step -- check time
** DONE Checking the reviewers' comments
CLOSED: [2022-01-26 Wed 13:08]
- State "DONE"       from              [2022-01-26 Wed 13:08]
:LOGBOOK:
CLOCK: [2022-01-25 Tue 12:52]--[2022-01-25 Tue 13:13] =>  0:21
:END:
** DONE Consider alternative applications
CLOSED: [2022-01-26 Wed 13:08]
- State "DONE"       from              [2022-01-26 Wed 13:08]
:LOGBOOK:
CLOCK: [2022-01-26 Wed 12:44]--[2022-01-26 Wed 13:08] =>  0:24
CLOCK: [2022-01-26 Wed 11:47]--[2022-01-26 Wed 12:42] =>  0:55
CLOCK: [2022-01-25 Tue 13:13]--[2022-01-25 Tue 13:25] =>  0:12
:END:
** TODO Kill already merged branches
 [2020-07-11 Sat 09:49]

- minor_fixes (figures, labels, etc.)
- scal_update (major scal update)

As of beginning of the day <2020-07-11> all of these are merged into =master=
** TODO Clean-up testing code (remove unnecessary, add separate testing)
 [2021-02-19 Fri 12:47]
** TODO add diagram generation tests :UFL:
** TODO Revise tests for key functions
** TODO Requires =gurobi= to run examples :doc:
 [2021-02-06 Sat 17:40]
 [[file:~/projects/align-BDD/UFL.py][file:~/projects/align-BDD/UFL.py]]
** TODO implement =BDD.save()= for a weighted BDD
 [2021-02-22 Mon 12:29]
** TODO Perhaps, =is_equivalent= is a bad name?
 [2021-02-22 Mon 13:48]
 [[file:~/projects/align-BDD/BDD.py]]

 Like, maybe rename to =test_equivalence=. And then =is_equivalent <- test_equivalence()[0]=
** TODO rename =VarSeq.layer_var= into =vars=, I suppose...
 [2021-02-22 Mon 17:52]
** TODO rename =?UFL= (streamlining names)
** TODO let S NOT contain the node itself -- amended later :tUFL:
 [2021-03-22 Mon 18:34]
** TODO figure (1) the order of types and (2) order of nodes within a type
 [2021-03-30 Tue 13:32]
** TODO Technical description :doc:
   - makefile
   - pytest and testing framework
** TODO maybe instances gallery for tUFL?

** DONE Introduce a proper testing framework
CLOSED: [2022-01-19 Wed 14:16]
- State "DONE"       from "TODO"       [2022-01-19 Wed 14:16]
** CANCELED Structure the code into a package + submodules
CLOSED: [2022-01-19 Wed 14:16]
** DONE Move =are_equivalent= method to =BDD.py=
   CLOSED: [2020-08-13 Thu 11:14]
 [2020-08-12 Wed 12:07]
 [[file:~/projects/align-BDD/experiments/BDD_size_illustration/BDD_size_illustration.py::B.load("./sample_5var_inst.bdd")]]
** DONE Maybe look into Sphinx?.. Or what is the best practice?         :doc:
CLOSED: [2022-01-19 Wed 14:15]
- State "DONE"       from "TODO"       [2022-01-19 Wed 14:15]

* Notes
  - revision notes:  [[mu4e:msgid:CO1PR01MB658375A8FEDC337330803037DE609@CO1PR01MB6583.prod.exchangelabs.com][Two ideas]] from JCS.
  - first submission corresponds to =master= commit =04a5b38=
    
